/*********************************************************************

	 파일		: SHMonstermeterManager.h
	 작성자		: hseos
	 작성일		: 2007/07/08

	 파일설명	: 몬스터미터 클래스의 헤더

 *********************************************************************/

#pragma once

//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
// 
//
class CSHMonstermeterManager
{
public:
	//----------------------------------------------------------------------------------------------------------------
	const static int	MAX_VALUE_NUM			=	2;

	enum REWARD_BEHAVE_TYPE												// 보상의 행동 종류
	{
		RBT_MONSTERKILL = 0,											// ..몬스터 킬 수
		RBT_PLAYTIME,													// ..플레이 타임
		MAX_REWARD_BEHAVE_TYPE
	};

	enum REWARD_TYPE													// 보상 종류
	{
		REWARD_TYPE_ITEM = 0,											// ..아이템
	};

	struct stREWARD_BASE												// 보상 기본
	{
		int			nBehaveNum;											// ..어떤 행동(몬스터 킬, 플레이 타임..)의 횟수
		REWARD_TYPE	eRewardType;										// ..보상 종류
		int			nValue[MAX_VALUE_NUM];								// ..보상 수치
	};

	struct stREWARD														// 보상
	{
		stREWARD_BASE*		stRewardBase;								// ..보상
		int					nNum;										// ..보상 개수
	};

private:
	//----------------------------------------------------------------------------------------------------------------
	stREWARD				m_stReward[MAX_REWARD_BEHAVE_TYPE];

public:
	//----------------------------------------------------------------------------------------------------------------
	CSHMonstermeterManager();
	~CSHMonstermeterManager();

	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 공용
	//
	//----------------------------------------------------------------------------------------------------------------
	//						스크립트 파일 로드
	BOOL					LoadScriptFileData();														


	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 서버					
	//
	//----------------------------------------------------------------------------------------------------------------
	//						보상 처리
	VOID					ProcessReward(CPlayer* pPlayer, REWARD_BEHAVE_TYPE eType, int nBehaveNum);

	//////////////////////////////////////////////////////////////////////////////////////////////////////////////////
	// 클라이언트
	//
};

extern CSHMonstermeterManager g_csMonstermeterManager;