#pragma once
//=================================================================================================
//	FILE		: TutorialBtnDlg.h
//	PURPOSE		: Button interface to notice about tutorial.
//	PROGRAMMER	: Yongs Lee
//	DATE		: October 23, 2007
//	ADDITION	:
//	ATTENTION	:
//=================================================================================================





//=========================================================================
//		필요한 헤더파일을 불러온다.
//=========================================================================
#include "./Interface/cDialog.h"											// 다이얼로그 인터페이스를 포함한다.





//=========================================================================
//		필요한 컨트롤 인터페이스를 선언한다.
//=========================================================================
class cButton ;																// 버튼 클래스를 선언한다.





//=========================================================================
//		튜토리얼 알림 버튼 다이얼로그 클래스 정의.
//=========================================================================
class cTutorialBtnDlg : public cDialog										// 튜토리얼 알림 버튼 다이얼로그 클래스.
{
	cButton*		m_pButton ;												// 알림 버튼 포인터.

	int				m_nAlpha ;												// 버튼 알파 변수.
	DWORD			m_dwStartTime ;											// 알파 시작 시간 변수.
public:
	// BASE PART.
	cTutorialBtnDlg(void);													// 생성자 함수.
	virtual ~cTutorialBtnDlg(void);											// 소멸자 함수.

	void Linking() ;														// 하위 컨트롤들을 링크하는 함수.

	virtual void OnActionEvent(LONG lId, void* p, DWORD we ) ;				// 이벤트 처리를 위한 함수.

	virtual void Render() ;													// 렌더 함수.

	void Active_NoticeBtn() ;												// 튜토리얼 공지 버튼을 활성화 시키는 함수.
};
